wenij/FISHv4th-OEM/FISH_STM32F4_IAR.s
 SECTION .text : CONST (2)
NULL_NFA:
	DC8	0x0C1			// A BINARY ZER
	DC8	0x80
 ALIGNROM 2,0xFFFFFFFF
	DC32	ENCL_NFA
NULL:
//	DC32	SEMIS			// Actual Semis code below
	DC32	.+5
 SECTION .text : CODE (2)
	POPr2i	// pop docol saved IP from Rstack
	NEXT


//	WORD WORD:	( c -- )
//	Parse the text in TIB , until a delimiter c is found, tokenizing input.
//	Move the token to HERE, with a count byte and 2 nulls at the end.
//	Leading occurrences of c are ignored. IN is incremented.
//      IN is initialized by FISH to 1 to account for the count byte in EXPECT.
//	See IN. Usually used inside a definition.

 SECTION .text : CONST (2)
WORD_NFA:
	DC8	0x84
	DC8	'WOR'
	DC8	'D'+0x80
 ALIGNROM 2,0xFFFFFFFF
	DC32	NULL_NFA
WORD:
	DC32	DOCOL
WORD1:
//      This is required for number suffix's at least ???
// NOT WITH NEW COUNTED NULL STRING EXPECT
//	DC32	HERE, LIT, MAXWORDLEN+2, BLANKS
	DC32	TIB_SV
WORD2:
	DC32	IN_SV
	DC32	AT
	DC32	PLUS
        DC32	SWAP	// ( TIB+IN CH-DELIM -- )
	DC32	ENCL    // ( TIB+IN 32 -- TIB+IN   0 4 5 )
WENCL:
	DC32	IN_SV	// encl TOS = end of word offset to be added to IN
	DC32	PSTORE  // TIB+IN   0 4
	DC32	OVER    //
	DC32	SUBB    // Char cnt going to R and HERE
	DC32	TOR
	DC32	R
	DC32	HERE
	DC32	CSTORE   // CHAR CNT OF word
	DC32	PLUS
	DC32	HERE
	DC32	ONEP
//	DC32	RFROM
// MOVE word TO DICT FOR finding ENDING WITH NULLS
        DC32    R
	DC32	CMOVE   // ( from to count -- )
// add null to end of token - NUMBER adjusted
        DC32    ZERO, HERE, ONEP, RFROM, PLUS, CSTORE
#ifdef  IOBUFS_DEBUG
        DC32    HERE, ONE, DUMP
#endif
	DC32	SEMIS


//	NUMBER NUMBER:	( addr -- sd )
//	If error print message and ABORT.
//      Convert a character string left at addr with a preceeding count,
//      and a terminating null, to a signed number, in the current numeric base.
//      If a decimal point is encountered in the text, its position will be
//      given in DPL, but no other effect occurs. If numeric conversion is
//      not possible, an error message will be given.

//      Added support for , as a single number formatter.

#define comma_test

 SECTION .text : CONST (2)
NUMBER_NFA:
	DC8	0x86
	DC8	'NUMBE'
	DC8	'R'+0x80
 ALIGNROM 2,0xFFFFFFFF
	DC32	WORD_NFA
NUMBER:
	DC32	DOCOL
        DC32    BASE_TO_R12     // Save current BASE.
        DC32    NUMBERSUFFIX    // (addr -- sddr) Change BASE if suffix used.

// SETUP: stack arguments for PNUMBER.
	DC32	ZERO, ZERO
	DC32	ROT		// ( 0 0 addr -- )

// SETUP: reeturn stack with sign flag
// NONAME CANDIDATE!
// START: Handle minus sign by saving status on Return Stack.
// and incrementing to addr after it.
	DC32	DUP, ONEP	// ( 0 0 addr addr+1 -- )
	DC32	CAT		// ( 0 0 addr 1rstchar -- )
	DC32	LIT, '-'	// ( 0 0 addr 1rstchar 0x2D --- )
	DC32	EQUAL		// ( 0 0 addr f -- )
#ifdef TRUE_EQU_NEG_ONE         // EQUAL returns -1 NEED 0 or 1 here!
        DC32    ONE, ANDD       // ( 0 0 addr f -- ) MAKE FLAG ONE OR ZERO!
#endif
	DC32	DUP, TOR	// ( 0 0 addr f -- ) copy of f >R
// END: Handle - by saving status on Return Stack.

// SETUP: addr pointing to 1rst digit.
// If minus sign, flag from above will increment to next char.
	DC32	PLUS		// Increment (OR NOT) addr to next char

// So could be at 1rst OR 2nd character in string here!

// ENTER LOOP WITH -1 DPL = single number and sign flag on return stack.
	DC32    LIT, -1
// PNUMBER is used in loop to convert string segment until non-mumeric chracter.
// A period in the string manipulates DPL to create a double number.
// A comma in the string resets DPL to create a single number.
// A null indicates the end of the string.
NUMB1:      			// Begin
	DC32	DPL_SV, STORE   // PNUMBER creates whole, dot or comma number segment

// PNUMBER converts one or more characters until first unconvertable digit.
// ud and addr in string is maintained while in loop.
        DC32	PNUMBER   	// ( 0 0 addr -- ud=(LSW MSW) ADDR=PAST#)
// Perform check for period, comma and null.
// Any other character here invalidates this number conversion.

// Null Test: = end of string.
        DC32    DUP, CAT
        DC32    ZERO            // End of string used to be BLANK, is now Null.
	DC32	SUBB
	DC32	ZBRAN   	// IF emd of number string conversion is
	DC32      NUMB2-. 	// DONE UNLESS IT NEEDS TO BE NEGATED.

// Period Test: = increment DPL.
	DC32	DUP, CAT
	DC32	LIT, '.'        // 2Eh = period.
	DC32	SUBB
        DC32    ZBRAN
        DC32      DPL_ZERO_INCR-.

#ifdef  comma_test
// Comma Test: = reset DPL.
        DC32    DUP, CAT
	DC32	LIT, ','        // 2CH comma
        DC32    EQUAL
        DC32    ZBRAN
        DC32      BASE_RESET_THEN_ERROR-.

// Fall thru if comma so reset DPL to create a single number.
DPL_RESET:
  DC32    TRUE_NEG_1
	DC32	BRAN
	DC32      NUMB1-.
#endif

BASE_RESET_THEN_ERROR:
// GOING TO ERROR SO RESTORE BASE!
        DC32    BASE_FROM_R12   // Restore BASE
//NO_BASE_RESTORE:
        DC32    ONE     // provide non zero flag for error
	DC32	LIT, msg_number_error
	DC32	QERROR // ( f nullstr-addr -- ) IF f TRUE EXECUTE ERROR!

DPL_ZERO_INCR:      // set DPL to zero
	DC32	ZERO
	DC32	BRAN
	DC32      NUMB1-.

NUMB2:
	DC32	DROP
	DC32	RFROM           // FLAG OF "-" TEST
	    			// IF
	DC32	ZBRAN
	DC32      NUMB3-.

	DC32	DNEGATE

NUMB3:        		        // endif
        DC32    BASE_FROM_R12   // Restore BASE
        DC32    SEMIS


//	ERROR ERROR:	( nullstr --- )
//	Execute error notification and restart of system.
//  IN_SV is saved to assist in determining the location of the error.

 SECTION .text : CONST (2)
ERROR_NFA:
	DC8	0x85
	DC8	'ERRO'
	DC8	'R'+0x80
 ALIGNROM 2,0xFFFFFFFF
//	DC32	DFIND_NFA
	DC32	NUMBER_NFA
ERROR:
	DC32	DOCOL
	DC32	HERE, COUNT, TYPE       // Offending item
	DC32	NULLSTRLEN, TYPE        // Passed in null string
#ifdef IO2TP
ERROR_BP1:
// DC32 NOOP   // View error message
   DC32 CLRPAD  // Resets OUT
#endif
#ifdef XON_XOFF
        DC32    XOFF    // TEMP TEST THRE
#endif

//      DO THIS WHERE STATE IS SET BACK TO ZERO
        DC32    STATE_SV, AT
        DC32    ZBRAN
        DC32     CREATED_OK-.

//      NON-ZERO CSDP = RESTORE DP TO forget DAMAGED WORDS
        DC32    CSDP_SV, AT   // Create saves dp here for if word exists err
        DC32    ZBRAN
        DC32     CREATED_OK-.

