wenij/FISHv4th-OEM/FISH_STM32F4_IAR.s
//	DUMP DUMP:	( addr n -- )
//	Print adrr and n lines of 4 columns of memory values in hexadecimal.
//	Address must be even and a multiple of 4 else error message issued.
//      Any key presssed will stop DUMP.

 SECTION .text : CONST (2)
DUMP_NFA:
	DC8	0x84
	DC8	'DUM'
	DC8	'P'+0x80
 ALIGNROM 2,0xFFFFFFFF
	DC32	DOTVARSPACE_NFA
DUMP:
	DC32	DOCOL

	DC32	OVER, QALIGNED  // \ -- addr n
// DON'T SAVE BASE UNTIL AFTER ALIGNED TEST
	DC32    BASE_TO_R12     // Save current BASE
	DC32    HEX
	DC32	ZERO, XDO
DUMP_ADDR_LINE:
	DC32	CR
	DC32	DUP, LIT, 10, DOTRU     // Print addr in Field
	DC32	FOUR, ZERO, XDO         // Four colum loop
DUMP_EACH_LOC:
	DC32	DUP, AT
// Little Endian means addresses will print correctly
// but to see character strings REVW is needed
// but the addresses are scrambled!
//        DC32    REVW                    // Reverse bytes in word
	DC32    LIT, 14, DOTRU          // Diplay in Field
	DC32	FOURP
	DC32	XLOOP
	DC32	  DUMP_EACH_LOC-.

#ifdef IO2TP
DUMP_BP1:
 DC32 NOOP	// IO2TP DUMP
	DC32    CLRPAD  // Resets OUT
#endif
	DC32    QKEY
	DC32    ZBRAN
	DC32     DUMP_CONT-.
	DC32    LEAVE
DUMP_CONT:
	DC32    XLOOP
	DC32	DUMP_ADDR_LINE-.

	DC32    DROP, CR
	DC32    BASE_FROM_R12   // Restore BASE
	DC32	SEMIS


//	VBASE VBASE:	( -- addr )
//       Return base addr of VAR's .

 SECTION .text : CONST (2)
VBASE_NFA:
	DC8	0x85
	DC8	'VBAS'
	DC8	'E'+0x80
 ALIGNROM 2,0xFFFFFFFF
	DC32	DUMP_NFA
VBASE:
	DC32    DOCON,  RAMVARSPACE_START


//	DBASE DBASE:	( -- addr )
//	Return base addr of the dictionary.

 SECTION .text : CONST (2)
DBASE_NFA:
	DC8	0x85
	DC8	'DBAS'
	DC8	'E'+0x80
 ALIGNROM 2,0xFFFFFFFF
	DC32	VBASE_NFA
DBASE:
	DC32    DOCON,  ORIG


//	RBASE RBASE:	( -- addr )
//	Return base addr of RAM.

 SECTION .text : CONST (2)
RBASE_NFA:
	DC8	0x85
	DC8	'RBAS'
	DC8	'E'+0x80
 ALIGNROM 2,0xFFFFFFFF
	DC32	DBASE_NFA
RBASE:
	DC32    DOCON,  RAM_START    // RAM WHERE DICT ALLOACTED IN MEMMAP


//	CLS CLS:	( -- )
//	Clear serial terminal screen using a formfeed character

 SECTION .text : CONST (2)
CLS_NFA:
	DC8	0x83
	DC8	'CL'
	DC8	'S'+0x80
 ALIGNROM 2,0xFFFFFFFF
	DC32	RBASE_NFA
CLS:
	DC32	DOCOL
	DC32    PDOTQ
	DC8     4
	DC8     0x1B, '['       // ESC[ = ANSI VT100 ESC SETUP
	DC8     '2J'            // Clearscreen
 ALIGNROM 2,0xFFFFFFFF
	DC32    PDOTQ
	DC8     4
	DC8     0x1B, '['       // ESC[ = ANSI VT00 ESC SETUP
	DC8     ';H'            // CURSORHOME \ upper left corner
 ALIGNROM 2,0xFFFFFFFF
	DC32    CR              // Reset OUT
	DC32	SEMIS


//	( PAREN:	( -- ) IMMEDIATE
//	Used in the form:
//		( CCcc )
//	Ignore comments within parenthesis. A right parenthesis ends comment.
//      The comments may be multi-line but a space or tab is required
//      for any line that is otherwise empty for formatting purposes,
//      else a comment error will be printed. May occur during execution or in a
//	colon-definition. A blank after the leading parenthesis is required.

 SECTION .text : CONST (2)
PAREN_NFA:
	DC8	0x0C1
	DC8	'('+0x80
 ALIGNROM 2,0xFFFFFFFF
	DC32	CLS_NFA
PAREN:
// Slow Single line comment
//      DC32    DOCOL, LIT, ')', WORD, SEMIS
	DC32	DOCOL
PML_LOOP:
	DC32    LIT, ')'
	DC32    TIB_CHAR_SCAN   // ( c -- f )
//
	DC32    ZEQU            // If null
	DC32    ZBRAN           // found fall thru
	DC32      PE_DONE-.     // else were done

// Acting like the outer interpreter here, signal DLE
	DC32    CR, LIT, 0x10, EMIT
	DC32    QUERY
//  AND IF ONLY CR (null) ERR
//        DC32    TIB_SV, CAT
	DC32    LIT, TIB+1, CAT // PAST COUNT BYTE
	DC32    ZBRAN
	DC32      PAREN_ERR-.

//  If closing paren not in this line LOOP
	DC32    BRAN
	DC32      PML_LOOP-.

PE_DONE:
	DC32    SEMIS

PAREN_ERR:
	DC32    LIT, msg_paren_err
	DC32	NULLSTRLEN, TYPE        // Passed in null string
	DC32    SEMIS


//	BACKSLASH BACKSLASH:	( --  )
//      After a trailing space treat the rest of the line as a comment.
//      By setting a null terminator in TIB

 SECTION .text : CONST (2)
BACKSLASH_NFA:
	DC8	0x0C1
	DC8	'\\'+0x80
 ALIGNROM 2,0xFFFFFFFF
	DC32	PAREN_NFA
BACKSLASH:
	DC32    DOCOL
	DC32    ZERO, TIB_SV, IN_SV, AT, PLUS, CSTORE
	DC32    SEMIS


//	SYSCLK SYSCLK:	( -- value )
//      Returns system clock value in Hz, i.e. 48000000 = 48Mhz.

 SECTION .text : CONST (2)
SYSCLK_NFA:
	DC8	0x86
	DC8	'SYSCL'
	DC8	'K'+0x80
 ALIGNROM 2,0xFFFFFFFF
	DC32	BACKSLASH_NFA
SYSCLK:
	DC32	.+5
 SECTION .text : CODE (2)
	LDR	n, = SYSCLOCK	// SystemCoreClock
	LDR	t_r0, [n]
	TPUSH_r0        // Push -- t_r0
 LTORG	 //Always outside of code, else data in words


//      STCTR   ( -- addr ) SYSTICK Interrupt increments this with 32but wrap.
//      STI_ON: 7 E000E010h !  STI_OFF: 5 E000E010h ! E000E010h @ .H
 SECTION .text : CONST (2)
STCTR_NFA:
	DC8	0x85
	DC8	'STCT'
	DC8	'R'+0x80
 ALIGNROM 2,0xFFFFFFFF
//	DC32	STI_ON_NFA
        DC32    SYSCLK_NFA
STCTR:
        DC32    DOCON, STICKER


//      DELAY ( n value -- ) 7 E000E010h !   5 E000E010h !
 SECTION .text : CONST (2)
DELAY_NFA:
	DC8	0x85
	DC8	'DELA'
	DC8	'Y'+0x80
 ALIGNROM 2,0xFFFFFFFF
	DC32	STCTR_NFA
DELAY:
	DC32	.+5
 SECTION .text : CODE (2)
        POP2n_r1           // Reload value in n
        POP2t_r0        // loop count in t
// SET STCTR TO NEGATIVE LOOP COUNT TO END AT ZERO
        LDR     y_r4, = STICKER
	MVNS    t_r0, t_r0      // 1's compliment
	ADDS    t_r0, t_r0, #1  // 2's compliment
        STR     t_r0, [y_r4]
// Load SYST_RVR with countdown value
        LDR     w_r2, = SYST_RVR
        STR     n_r1, [w_r2]
// and reset SYST_CVR to start countdown.
       LDR     w_r2, = SYST_CVR
// Writing it clears the System Tick counter and the COUNTFLAG bit in STCTRL.
        STR     n_r1, [w]
// If n=0 in t user is just setting reload value
        CMP     t_r0, #0           // LOOP OF ZERO
        BEQ     DELAY_DONE
// INTERRUPT VERSION: negate n to STCTR and leave when STCTR = 0
// STI_ON: 7 E000E010h !  STI_OFF: 5 E000E010h ! E000E010h @ .H
// Save and restore user interrupt setting
// y = STICKER
        LDR     w_r2, = SYST_CSR
        LDR     t_r0, [w_r2]          // Save user SYSTICK interrupt setting
        MOVS    n_r1, #7
        STR     n_r1, [w_r2]          // Turn SYSTICK interrupt on in case it's off
DELAY_LOOP:
        LDR     n_r1, [y_r4]
        CMP     n_r1, #0
        BNE     DELAY_LOOP
DELAY_DONE:
        STR     t_r0, [w_r2]  // Restore user SYSTICK interrupt setting
	NEXT
 LTORG


