wenij/FISHv4th-OEM/FISH_STM32F4_IAR.s
//	FISH FISH:	( -- )
//	Print Flash Status and FISH Signon Message.

 SECTION .text : CONST (2)
FISH_NFA:
	DC8	0x84
	DC8	'FIS'
	DC8	'H'+0x80
 ALIGNROM 2,0xFFFFFFFF
	DC32	FISH_ONLY_NFA
FISH:
	DC32	DOCOL
  DC32    FLASH_SCAN
	DC32	SIGNON
	DC32	SEMIS

//=============================== WORDCAT ====================================//
//NOEXEC HEADERFORWORDCATEGORIES
//	WC_FISH_PubRel: = FISH Reference Model: CATEGORY
 SECTION .text : CONST (2)
WC_FISH_PubRel_NFA:
	DC8	0x80+4+21        // +4 is format chars constant
                                // +n is Name lenght
        DC8     0x0D, 0x0A
	DC8	'FISH Reference Model:'
        DC8     0x0D, 0x0A+0x80
 ALIGNROM 2,0xFFFFFFFF
        DC32    FISH_NFA

;**** FIRST WORD LISTED IS A WORDCAT~!****

//========================== FISH OEM WORDCAT LIST ===========================//
/* To make a new WORDCAT the current TOP of the Dictionary:
iNCLUDE NEW WC FILE IN IAR.S: FISH OEM WORDCAT LIST
The top of the dictionary is defined in these places:
In SLIBS SV_INIT_VALUES:
//        DC32    WC_FISH_PubRel_NFA // FISH in flash starts here = CURRENT
IN FLASH RAMWORDS:
//        DC32    LIT, WC_FISH_PubRel_NFA // FISH in flash starts here = CURRENT
In IAR FISH_ONLY:
//        LDR     n, = WC_FISH_PubRel_NFA
*/
//======================== B.I.G.PSTAT GPIO WORDCAT ==========================//
$FISH_GPIO_WC.h
// If included link below will point to the GPIO WORDCAT
//#endif
// FIRST WORDCAT

//------------------------------------------------------------------------------
// FOR MULTI TASKING MUST BE PLACED IN RAM AND OFFSET USED IN SYSTEM VARS!!!!!!
//            T A S K
//
;.data		// Place TASK at beginning of RAM, or not.
/*
 SECTION .text : CONST (2)
TASK_NFA:
	DC8	0x84
	DC8	'TAS'
	DC8	'K'+0x80
 ALIGNROM 2,0xFFFFFFFF
//	TASK Is top of dictionary until new definitionsa added
//	PATCH CONTEXT or LATEST else LFA in TASK FROM SYM TABLE
//	To debug dictionary searches - see - PFIND & DFIND
//	DC32	ZEQU_NFA	// 4 (no match) bombing at +
//	DC32	NOOP_NFA	// Patch here to shorten test of PFIND
//	DC32	CAT_NFA		// C@ before @
//	DC32	LESS_NFA	// < before =
//       DC32	SoCinit_NFA	//XON_NFA		// FULL DICT SEARCH
        DC32    MS_NFA
TASK:
	DC32	DOCOL
	DC32	SEMIS
*/

//------------------------------------------------------------------------------
//:NONAME SECTION:
// THESE STAY HERE (INSTEAD OF SLLIB) BECAUSE THEY ARE CONDITIONALLY INCLUDED
// HI-LEVEL THEM ASM SECTIONS
#ifdef IO2TP
//:NONAME CLRPAD:     ( -- ) FILL PAD with BLANK'S.
 SECTION .text : CONST (2)
// ALIGNROM 2,0xFFFFFFFF
CLRPAD:
        DC32    DOCOL, PAD_SV, LIT, IOBUFSIZE
        DC32    BLANK,  FILL
        DC32    zero_OUT
        DC32    SEMIS
#endif

#ifdef IO2TP
//:NONAME CLRTIB:     ( -- ) FILL TIB with NULLS to terminate input
 SECTION .text : CONST (2)
// ALIGNROM 2,0xFFFFFFFF
CLRTIB:
	DC32    DOCOL, TIB_SV, LIT, IOBUFSIZE
        DC32    ERASE
        DC32    STRVA, 1, IN
        DC32    SEMIS
#endif

#ifdef USE_CMAIN
//:NONAME FISH_return2c:      ( -- ) POP main.c saved lr saved in FM0_COLD
 SECTION .text : CONST (2)
 ALIGNROM 2,0xFFFFFFFF
FISH_return2c:
	DC32	.+5
 SECTION .text : CODE (2)
	LDR	t_r0, [sp]
	ADD	sp, sp, #4
	MOV	pc, t_r0
#endif

#ifdef TESTRAM
//:NONAME flogRAM:    ( -- ) Non destructively test RAM
// RAM_START and RAM_END defined in FISH_M0_EQUATES.H
 SECTION .text : CONST (2)
flogRAM:
	DC32	.+5
 SECTION .text : CODE (2)
	mov	lr, t_r0
	mov	pc, n_r1
	mov	ra_r10, i_r5       	//  SAVE IP !!!
	ldr	t_r0, = RAM_START	// RAM_START
	ldr	y_r4, = RAM_END	        // (RAM_END +1)		//  limit
_flogRAM:
	ldr	x_r3, [t_r0]	//  save original contents

	movs	n_r1, #0	//  all zeros
	str	n_r1, [t_r0]
	ldr	w_r2, [t_r0]
	eors	w_r2, w_r2, n_r1
	bne	_trap

	ldr	n_r1, =-1	//  all ones
	str	n_r1, [t_r0]
	ldr	w_r2, [t_r0]
	eors	w_r2, w_r2, n_r1
	bne	_trap

	movs	n_r1, t_r0	//  it's own address
	str	n_r1, [t_r0]
	ldr	w_r2, [t_r0]
	eors	w_r2, w_r2, n_r1
	bne	_trap

	mvns	n_r1, t_r0	//  complement of it's own address
	str	n_r1, [t_r0]
	ldr	w_r2, [t_r0]
	eors	w_r2, w_r2, n_r1
	bne	_trap


	ldr	n_r1, = 0xFFFFFFFE
	movs	i_r5, #32
_walkzeros:
	str	n_r1, [t_r0]
	ldr	w_r2, [t_r0]
	eors	w_r2, w_r2, n_r1
	bne	_trap

	lsls	n_r1, n_r1, #1
	adds	n_r1, n_r1, #1
	subs	i_r5, i_r5, #1
	bne	_walkzeros


	movs	n_r1, #1
	movs	i_r5, #32
_walkones:
	str	n_r1, [t_r0]
	ldr	w_r2, [t_r0]
	eors	w_r2, w_r2, n_r1
	bne	_trap

	lsls	n_r1, n_r1, #1
	subs	i_r5, i_r5, #1
	bne	_walkones


	ldr	n_r1, = 0xFFFFFFFE
	movs	i_r5, #32
_slidezeros:
	str	n_r1, [t_r0]
	ldr	w_r2, [t_r0]
	eors	w_r2, n_r1
	bne	_trap

	lsls	n_r1, n_r1, #1
	subs	i_r5, i_r5, #1
	bne	_slidezeros


	movs	n_r1, #1
	movs	i_r5, #32
_slideones:
	str	n_r1, [t_r0]
	ldr	w_r2, [t_r0]
	eors	w_r2, n_r1
	bne	_trap

	lsls	n_r1, n_r1, #1
	adds	n_r1, n_r1, #1
	subs	i_r5, i_r5, #1
	bne	_slideones


	str	x_r3, [t_r0]	//  restore original contents
	adds	t_r0, t_r0, #4
	cmp	t_r0, y_r4
	blo	_flogRAM

_notrap:
	mov	t_r0, r8        // R8 = lINK REGISTER
	mov	n_r1, r9
	mov	i_r5, r10	//  RESTORE IP !!!
	NEXT
_trap:	b	.
 LTORG
#endif  // TESTRAM
//------------------------------------------------------------------------------
// Placing blocks that can change at end of link map
// Place :NONAME for static Library first in FISH_STM_M3_SLIB.s

// $PROJ_DIR$\..\FISH_RM_COMMON
// $PROJ_DIR$\..\FISH_RM_CORTEX_M_COMMON_CODE
// In Assembler preprocessor set additional include directories
$FISH_RM_MSGS.h
// equals below
//#include ".\..\FISH_COMMON_CODE\FISH_RM_MSGS.h"

// SYSTEMCLOCK #define set in FISH_M0_EQUATES.s for SYSCLOCK value.
// THIS IS A :NONAME WORDSET

$FISH_STM32F4_SOC_INIT.s

 END

